api/app/controllers/api/v1/addresses_controller.rb

  def update
   if @address.update(address_params)
---
UPDATE `addresses` SET `zip_code` = '31050-721', `updated_at` = '2019-05-19 13:57:49' WHERE `addresses`.`id` = 1

  def get_close_barrage
    @barrage = Barrage.search(@address).first
---
SELECT  `barrages`.* FROM `barrages` WHERE (barrages.lat IS NOT NULL AND barrages.lng IS NOT NULL) AND (barrages.lat>-19.942601373789184 AND barrages.lat<-19.85275062621082 AND barrages.lng>-43.949027603160246 AND barrages.lng<-43.85347239683975) AND ((

  def set_address
    @address = Address.find(params[:id])
---
SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`deleted_at` IS NULL AND `addresses`.`id` = 1 LIMIT 1