api/app/controllers/api/v1/users_controller.rb

    def create
      @user = User.create!(sign_up_params)
---
INSERT INTO `users` (`email`, `encrypted_password`, `name`, `phone`, `cpf`, `created_at`, `updated_at`, `uid`) VALUES ('diogo@email.com', '$2a$11$F7m0e5ybAEYi0IJcu6ACIuTuv.6xxn/ToWO/lVDK5ck9owIzDE346', 'diogo', '(99) 9999-9999', '123456789-09', '2019-05-19 13:25:43', '2019-05-19 13:25:43', 'diogo@email.com')

    def password
      # authorize @user
      @user.update_with_password!(password_params)
---
UPDATE `users` SET `encrypted_password` = '$2a$11$3hcE52MUczJzYFQVkhxLn.E36cP1.4b/Oaop2/CgmkdfrYphO/VoK', `updated_at` = '2019-05-19 14:59:34' WHERE `users`.`id` = 1